docs/comp-sci/lisp/toy-lispkit.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Toy LispKit Compiler</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Toy LispKit Compiler</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-193c100a-f7f9-4a3f-9d00-2c4f8b55ebc3">1. Introduction</a></li>
<li><a href="#h-ddf13874-2d98-40eb-a7e7-7ba20eee7b41">2. Lisp Primitives</a></li>
<li><a href="#h-5d573b7e-8dcb-4490-9781-ca307200782f">3. Compiling to SECD</a>
<ul>
<li><a href="#h-e8d4c07b-1a2b-4398-8ec8-f027194e3471">3.1. Helper Functions</a></li>
<li><a href="#h-732b7cb4-396b-4469-839e-7a45e8636baa">3.2. Compile SExpression</a>
<ul>
<li><a href="#h-9a92a2ad-41fc-452d-a0d5-dae117769683">3.2.1. Compiling Let-expressions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-8c101aab-be9e-4cb3-82ff-cd053abae6b0">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-193c100a-f7f9-4a3f-9d00-2c4f8b55ebc3" class="outline-2">
<h2 id="h-193c100a-f7f9-4a3f-9d00-2c4f8b55ebc3"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-193c100a-f7f9-4a3f-9d00-2c4f8b55ebc3">
<p>
Following Peter Henderson's book, I'm going to investigate implementing
a toy compiler for a simple Lisp targeting the <a href="../abstract-machines/secd.html">SECD machine</a>.
For completeness, I will try to write down the language for the Lisp
fragment, then I will write the compiler for the Lisp fragment.
</p>
</div>
</div>

<div id="outline-container-h-ddf13874-2d98-40eb-a7e7-7ba20eee7b41" class="outline-2">
<h2 id="h-ddf13874-2d98-40eb-a7e7-7ba20eee7b41"><span class="section-number-2">2.</span> Lisp Primitives</h2>
<div class="outline-text-2" id="text-h-ddf13874-2d98-40eb-a7e7-7ba20eee7b41">
<p>
The language will provide the following primitives:
</p>

<ul class="org-ul">
<li><code>(ADD p q)</code> gives us <code>p+q</code></li>
<li><code>(SUB p q)</code> gives us <code>p-q</code></li>
<li><code>(MUL p q)</code> gives us <code>p*q</code></li>
<li><code>(DIV p q)</code> gives us <code>p/q</code></li>
<li><code>(EXP p q)</code> gives us <code>p**q</code> (or <code>p^q</code>, depending on your notational
preferences)</li>
<li><code>(rem p q)</code> is the remainder of <code>p</code> divided by <code>q</code></li>
<li><code>(leq p q)</code> is <code>T</code> if <code>p</code> is less than or equal to <code>q</code>, <code>F</code> otherwise</li>
<li><code>(atom &lt;exp&gt;)</code> is <code>T</code> if the value of <code>&lt;exp&gt;</code> is an atom (number or
symbol) and <code>F</code> otherwise</li>
<li><code>(if &lt;test&gt; &lt;exp1&gt; &lt;exp2&gt;)</code> evaluates <code>&lt;test&gt;</code> and if it evaluates to
<code>T</code>, then it returns <code>&lt;exp1&gt;</code>; otherwise, it returns <code>&lt;exp2&gt;</code>.</li>
<li><code>(cons &lt;exp1&gt; &lt;exp2&gt;)</code> forms the list whose car is <code>&lt;exp1&gt;</code> and cdr is <code>&lt;exp2&gt;</code></li>
<li><code>(quote &lt;exp&gt;)</code></li>
<li><code>(eq &lt;exp1&gt; &lt;exp2&gt;)</code> returns <code>T</code> provided both are atoms and both are
the same number (or both are the same symbol)</li>
<li><code>(head &lt;exp&gt;)</code> returns the car of a list</li>
<li><code>(tail &lt;exp&gt;)</code> returns the cdr of a list</li>
<li><code>(let &lt;exp&gt; . &lt;declarations&gt;)</code> is more commonly swapped, the
declarations are of the form <code>(&lt;name&gt; . &lt;exp&gt;)</code></li>
<li><code>(lambda &lt;arg list&gt; &lt;exp&gt;)</code> where <code>&lt;arg list&gt;</code> is a list of names</li>
<li><code>(&lt;exp&gt; &lt;exp1&gt; &lt;exp2&gt; ...)</code> is function application</li>
<li><code>(letrec &lt;exp&gt; . &lt;declarations&gt;)</code> permits declarations recursively</li>
<li><code>(chr &lt;exp&gt;)</code> is the ASCII character with codepoint given by the
numeric value of <code>&lt;exp&gt;</code></li>
</ul>
</div>
</div>

<div id="outline-container-h-5d573b7e-8dcb-4490-9781-ca307200782f" class="outline-2">
<h2 id="h-5d573b7e-8dcb-4490-9781-ca307200782f"><span class="section-number-2">3.</span> Compiling to SECD</h2>
<div class="outline-text-2" id="text-h-5d573b7e-8dcb-4490-9781-ca307200782f">
<p>
Let's now examine how to compile Lisp expressions to SECD code. This
summarizes section 6.3 in Henderson's <cite class="book-title">Functional Programming</cite>.
We basically want to examine how a function <code>compile(exp, namelist)</code>
is inductively defined.
</p>
</div>

<div id="outline-container-h-e8d4c07b-1a2b-4398-8ec8-f027194e3471" class="outline-3">
<h3 id="h-e8d4c07b-1a2b-4398-8ec8-f027194e3471"><span class="section-number-3">3.1.</span> Helper Functions</h3>
<div class="outline-text-3" id="text-h-e8d4c07b-1a2b-4398-8ec8-f027194e3471">
<p>
We need some helper functions first to make sense of the namelist data
structure.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">position</span>(<span class="org-type">Symbol</span> *<span class="org-variable-name">x</span>, <span class="org-type">List</span> *<span class="org-variable-name">a</span>) {
    <span class="org-keyword">if</span> (eq(x, car(a))) {
        <span class="org-keyword">return</span> 0;
    } <span class="org-keyword">else</span> {
        1+position(x,cdr(a));
    }
}
<span class="org-type">bool</span> <span class="org-function-name">member</span>(<span class="org-type">Symbol</span> *<span class="org-variable-name">x</span>, <span class="org-type">List</span> *<span class="org-variable-name">l</span>) {
    <span class="org-keyword">if</span> (eq(l, NIL)) {
        <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (eq(x, car(l))) {
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> member(x, cdr(l));
    }
}
</pre>
</div>

<p>
The location of a symbol in a namelist can now be given, which will
return the pair <code>(p . q)</code> encoding its position.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">List</span>* <span class="org-function-name">location</span>(<span class="org-type">Symbol</span> *<span class="org-variable-name">x</span>, <span class="org-type">List</span> *<span class="org-variable-name">namelist</span>) {
    <span class="org-keyword">if</span> (member(x, car(namelist))) {
        <span class="org-keyword">return</span> new_list(0, position(x, car(namelist)));
    } <span class="org-keyword">else</span> {
        <span class="org-type">List</span> *<span class="org-variable-name">z</span> = location(x, cdr(namelist));
        z-&gt;car++;
        <span class="org-keyword">return</span> z;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-h-732b7cb4-396b-4469-839e-7a45e8636baa" class="outline-3">
<h3 id="h-732b7cb4-396b-4469-839e-7a45e8636baa"><span class="section-number-3">3.2.</span> Compile SExpression</h3>
<div class="outline-text-3" id="text-h-732b7cb4-396b-4469-839e-7a45e8636baa">
<p>
To compile an S-Expression to SECD code, we have:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">SecdBytecode</span>* <span class="org-function-name">compile</span>(<span class="org-type">SExp</span> *<span class="org-variable-name">expr</span>) {
    <span class="org-keyword">return</span> comp(e, NIL, cons(SECD_APPLY, cons(SECD_STOP, NIL)));
}
</pre>
</div>

<p>
Now we compile an expression <code>e</code> against a namelist <code>n</code> and list of SECD
bytecode <code>c</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">List</span>* <span class="org-function-name">comp</span>(<span class="org-type">SExp</span> *<span class="org-variable-name">e</span>, <span class="org-type">SExp</span> *<span class="org-variable-name">n</span>, <span class="org-type">SExp</span> *<span class="org-variable-name">c</span>) {
    <span class="org-keyword">if</span> (is_atom(e)) {
        <span class="org-keyword">return</span> cons(SECD_LD, cons(location(e, n), c));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_quote(car(e))) {
        <span class="org-keyword">return</span> cons(SECD_LDC, cons(cadr(e), c));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_eq(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_EQ, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_add(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_ADD, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_sub(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_SUB, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_mul(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_MUL, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_div(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_DIV, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_rem(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_REM, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_leq(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, comp(caddr(e), n, cons(SECD_LEQ, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_car(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, cons(SECD_CAR, c));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_cdr(car(e))) {
        <span class="org-keyword">return</span> comp(cadr(e), n, cons(SECD_CDR, c));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (eq(car(e)), ATOM) {
        <span class="org-keyword">return</span> comp(cadr(e), n, cons(SECD_ATOM, c));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_cons(car(e))) {
        <span class="org-keyword">return</span> comp(caddr(e), n, comp(cadr(e), n, cons(SECD_CONS, c)));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_if(car(e))) {
        <span class="org-type">SExp</span> *<span class="org-variable-name">then_clause</span> = comp(caddr(e), n, cons(SECD_JOIN, NIL));
        <span class="org-type">SExp</span> *<span class="org-variable-name">else_clause</span> = comp(cadddr(e), n, cons(SECD_JOIN, NIL));
        <span class="org-keyword">return</span> comp(cadr(e), n, cons(SECD_SEL, cons(then_clause, cons(else_clause, c))));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_lambda(car(e))) {
        <span class="org-type">SExp</span> *<span class="org-variable-name">body</span> = comp(caddr(e), cons(cadr(e), n), cons(SECD_RTN, NIL));
        <span class="org-keyword">return</span> cons(SECD_LDF, cons(body, c));
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_let(car(e))) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">supposed to be: bindings = cddr(e);</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">SExp *namelist = cons(vars(cadr(e)), n);</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">SExp *ags = exprs(cadr(e));</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">SExp *body = compile_list(cddr(e), namelist, cons(SECD_RTN, NIL));</span>
        <span class="org-keyword">return</span> compile_let(e, n, c);
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (is_letrec(car(e))) {
        <span class="org-keyword">return</span> compile_letrec(e, n, c);
    }
}
</pre>
</div>
</div>

<div id="outline-container-h-9a92a2ad-41fc-452d-a0d5-dae117769683" class="outline-4">
<h4 id="h-9a92a2ad-41fc-452d-a0d5-dae117769683"><span class="section-number-4">3.2.1.</span> Compiling Let-expressions</h4>
<div class="outline-text-4" id="text-h-9a92a2ad-41fc-452d-a0d5-dae117769683">
<p>
When compiling <code>(let ((x1 e1) ... (x-n e-n)) body)</code>, we rewrite this as
<code>((lambda (x1 ... x-n) body) e1 ... e-n)</code>.
</p>

<p>
We have the ancillary functions when compiling <code>(let ...)</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">SExp</span>* <span class="org-function-name">vars</span>(<span class="org-type">SExp</span> *<span class="org-variable-name">d</span>) {
    <span class="org-keyword">if</span> (eq(d, NIL)) {
        <span class="org-keyword">return</span> NIL;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> cons(caar(d), vars(cdr(d)));
    }
}

<span class="org-type">SExp</span>* <span class="org-function-name">exprs</span>(<span class="org-type">SExp</span> *<span class="org-variable-name">d</span>) {
    <span class="org-keyword">if</span> (eq(d, NIL)) {
        <span class="org-keyword">return</span> NIL;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> cons(cdar(d), exprs(cdr(d)));
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-h-8c101aab-be9e-4cb3-82ff-cd053abae6b0" class="outline-2">
<h2 id="h-8c101aab-be9e-4cb3-82ff-cd053abae6b0"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-h-8c101aab-be9e-4cb3-82ff-cd053abae6b0">
<ul class="org-ul">
<li>P. Henderson,
<cite class="book-title">Functional Programming: Application and Implementation</cite>.
Prentice-Hall, 1980.</li>
<li><a href="http://www.lispme.de/lispme/index_en.html">LispMe</a> is a simple Scheme-to-SECD compiler written in C, designed for
PalmPilot.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-06-01 Tue 10:00.</p>
</div>
</body>
</html>